In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20140101', periods = 7)

In [5]:
dates

DatetimeIndex(['2014-01-01', '2014-01-02', '2014-01-03', '2014-01-04',
               '2014-01-05', '2014-01-06', '2014-01-07'],
              dtype='datetime64[ns]', freq='D')

In [6]:
np.random.randn(7, 4)

array([[-1.93336567, -1.5762143 , -0.86678184,  1.8531145 ],
       [-0.32336601,  0.0650979 , -0.99079654,  0.8169863 ],
       [ 0.58510163, -0.83297755, -0.5744221 , -0.95481717],
       [ 1.30479489,  0.01224857,  0.57257588,  0.65793917],
       [-2.22794883, -0.81807648, -0.76416351,  0.1016447 ],
       [-0.5619217 , -0.61724711,  0.1081901 , -0.80713987],
       [-1.08402489,  0.35811607, -1.28620698, -1.11405853]])

In [8]:
df = pd.DataFrame(np.random.randn(7, 5), index = dates, columns = list('ABCDE'))

In [9]:
df

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220

In [10]:
 df2 = pd.DataFrame({ 'A' : 1.5,
                      'B' : pd.Timestamp('20140102'),
                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                      'D' : np.array([3] * 4,dtype='int32'),
                      'E' : pd.Categorical(["test","train","test","train"]),
                      'F' : 'foo' })

In [11]:
df2

     A          B    C  D      E    F
0  1.5 2014-01-02  1.0  3   test  foo
1  1.5 2014-01-02  1.0  3  train  foo
2  1.5 2014-01-02  1.0  3   test  foo
3  1.5 2014-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df2.A

0    1.5
1    1.5
2    1.5
3    1.5
Name: A, dtype: float64

In [14]:
df.head()

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602

In [15]:
df.describe()

              A         B         C         D         E
count  7.000000  7.000000  7.000000  7.000000  7.000000
mean  -0.162323 -0.258184  0.393278  0.530779  0.037111
std    0.818612  1.301496  0.687707  0.669947  1.493567
min   -1.115315 -2.247744 -0.912747 -0.234791 -2.814144
25%   -0.897121 -1.169972  0.202948  0.005406 -0.549878
50%    0.133222  0.123263  0.366732  0.312770  0.851602
75%    0.298331  0.688645  0.860975  1.138891  1.039771
max    1.043411  1.279846  1.171115  1.348878  1.242530

In [16]:
df.T

,2014-01-01 00:00:00,2014-01-02 00:00:00,2014-01-03 00:00:00,2014-01-04 00:00:00,2014-01-05 00:00:00,2014-01-06 00:00:00,2014-01-07 00:00:00
A,0.133222,0.279083,-1.079354,1.043411,0.317580,-1.115315,-0.714889
B,0.993206,0.123263,-1.332392,-2.247744,-1.007552,0.384083,1.279846
C,0.811738,0.910211,0.127352,-0.912747,0.278544,1.171115,0.366732
D,-0.167453,1.348878,0.999843,-0.234791,1.277939,0.178264,0.312770
E,1.242530,-0.106072,-2.814144,-0.993684,0.851602,0.890322,1.189220

In [21]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220

In [22]:
df.sort_values(by = 'E')

                   A         B         C         D         E
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530

In [23]:
df[0:3]

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144

In [25]:
df.loc[dates[1]]

A    0.279083
B    0.123263
C    0.910211
D    1.348878
E   -0.106072
Name: 2014-01-02 00:00:00, dtype: float64

In [28]:
df.loc[:, ['B']]

                   B
2014-01-01  0.993206
2014-01-02  0.123263
2014-01-03 -1.332392
2014-01-04 -2.247744
2014-01-05 -1.007552
2014-01-06  0.384083
2014-01-07  1.279846

In [29]:
df.loc['2014-01-01':'2014-01-06', ['A','C']]

                   A         C
2014-01-01  0.133222  0.811738
2014-01-02  0.279083  0.910211
2014-01-03 -1.079354  0.127352
2014-01-04  1.043411 -0.912747
2014-01-05  0.317580  0.278544
2014-01-06 -1.115315  1.171115

In [30]:
df.loc[dates[0:3], ['A']]

                   A
2014-01-01  0.133222
2014-01-02  0.279083
2014-01-03 -1.079354

In [31]:
df.loc[dates[3], 'D']

-0.23479054104815336

In [33]:
df

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220

In [32]:
df.iloc[3]

A    1.043411
B   -2.247744
C   -0.912747
D   -0.234791
E   -0.993684
Name: 2014-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[[1,3,5], 0:3]

                   A         B         C
2014-01-02  0.279083  0.123263  0.910211
2014-01-04  1.043411 -2.247744 -0.912747
2014-01-06 -1.115315  0.384083  1.171115

In [37]:
df.iat[2,2]

0.12735182928571062

In [40]:
df[df.B > 0]

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220

In [41]:
df[df>0]

                   A         B         C         D         E
2014-01-01  0.133222  0.993206  0.811738       NaN  1.242530
2014-01-02  0.279083  0.123263  0.910211  1.348878       NaN
2014-01-03       NaN       NaN  0.127352  0.999843       NaN
2014-01-04  1.043411       NaN       NaN       NaN       NaN
2014-01-05  0.317580       NaN  0.278544  1.277939  0.851602
2014-01-06       NaN  0.384083  1.171115  0.178264  0.890322
2014-01-07       NaN  1.279846  0.366732  0.312770  1.189220

In [42]:
df2 = df.copy()

In [43]:
df2['F'] = ['one', 'one','two','three','four','three','five']

In [44]:
df2

                   A         B         C         D         E      F
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530    one
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072    one
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144    two
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684  three
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602   four
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322  three
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220   five

In [46]:
df2[df2.F.isin(['two','four'])]

                   A         B         C         D         E     F
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144   two
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602  four

In [47]:
s1 = pd.Series([1,2,3,4,5,6,7], index=pd.date_range('20140102', periods=7))

In [49]:
df['F'] = s1

In [52]:
df.at[dates[2], 'F'] = 18

In [53]:
df

                   A         B         C         D         E     F
2014-01-01  0.133222  0.993206  0.811738 -0.167453  1.242530   NaN
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072   1.0
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144  18.0
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684   3.0
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602   4.0
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322   5.0
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220   6.0

In [54]:
df.iat[0,1] = 0

In [55]:
df

                   A         B         C         D         E     F
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530   NaN
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072   1.0
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144  18.0
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684   3.0
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602   4.0
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322   5.0
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220   6.0

In [56]:
df.loc[:, 'F'] = np.array([6]*len(df))

In [57]:
df

                   A         B         C         D         E  F
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530  6
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072  6
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144  6
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684  6
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602  6
2014-01-06 -1.115315  0.384083  1.171115  0.178264  0.890322  6
2014-01-07 -0.714889  1.279846  0.366732  0.312770  1.189220  6

In [59]:
df2 = df.copy()
df2[df2 > 0] = -df2

In [60]:
df2

                   A         B         C         D         E  F
2014-01-01 -0.133222  0.000000 -0.811738 -0.167453 -1.242530 -6
2014-01-02 -0.279083 -0.123263 -0.910211 -1.348878 -0.106072 -6
2014-01-03 -1.079354 -1.332392 -0.127352 -0.999843 -2.814144 -6
2014-01-04 -1.043411 -2.247744 -0.912747 -0.234791 -0.993684 -6
2014-01-05 -0.317580 -1.007552 -0.278544 -1.277939 -0.851602 -6
2014-01-06 -1.115315 -0.384083 -1.171115 -0.178264 -0.890322 -6
2014-01-07 -0.714889 -1.279846 -0.366732 -0.312770 -1.189220 -6

In [61]:
df1 = df.reindex(index=dates[0:5], columns=list(df.columns) + ['G'])

In [62]:
df1

                   A         B         C         D         E  F   G
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530  6 NaN
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072  6 NaN
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144  6 NaN
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684  6 NaN
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602  6 NaN

In [66]:
df1.iloc[0:2, 6] = 1

In [67]:
df1

                   A         B         C         D         E  F    G
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530  6  1.0
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072  6  1.0
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144  6  NaN
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684  6  NaN
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602  6  NaN

In [68]:
df1.dropna(how='any')

                   A         B         C         D         E  F    G
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530  6  1.0
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072  6  1.0

In [69]:
df1.fillna(value=8)

                   A         B         C         D         E  F    G
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530  6  1.0
2014-01-02  0.279083  0.123263  0.910211  1.348878 -0.106072  6  1.0
2014-01-03 -1.079354 -1.332392  0.127352  0.999843 -2.814144  6  8.0
2014-01-04  1.043411 -2.247744 -0.912747 -0.234791 -0.993684  6  8.0
2014-01-05  0.317580 -1.007552  0.278544  1.277939  0.851602  6  8.0

In [70]:
pd.isnull(df1)

                A      B      C      D      E      F      G
2014-01-01  False  False  False  False  False  False  False
2014-01-02  False  False  False  False  False  False  False
2014-01-03  False  False  False  False  False  False   True
2014-01-04  False  False  False  False  False  False   True
2014-01-05  False  False  False  False  False  False   True

In [72]:
df.mean()
df.mean(1)

2014-01-01    1.336673
2014-01-02    1.425894
2014-01-03    0.316884
2014-01-04    0.442408
2014-01-05    1.286352
2014-01-06    1.251412
2014-01-07    1.405613
Freq: D, dtype: float64

In [80]:
s = pd.Series([1,3,5,np.nan,6,8,9], index=dates).shift(2)

In [81]:
s

2014-01-01    NaN
2014-01-02    NaN
2014-01-03    1.0
2014-01-04    3.0
2014-01-05    5.0
2014-01-06    NaN
2014-01-07    6.0
Freq: D, dtype: float64

In [82]:
df.apply(np.cumsum)

                   A         B         C         D         E   F
2014-01-01  0.133222  0.000000  0.811738 -0.167453  1.242530   6
2014-01-02  0.412306  0.123263  1.721949  1.181425  1.136458  12
2014-01-03 -0.667049 -1.209128  1.849301  2.181268 -1.677686  18
2014-01-04  0.376363 -3.456872  0.936554  1.946477 -2.671370  24
2014-01-05  0.693942 -4.464424  1.215098  3.224417 -1.819768  30
2014-01-06 -0.421373 -4.080341  2.386213  3.402681 -0.929446  36
2014-01-07 -1.136261 -2.800495  2.752946  3.715451  0.259774  42

In [84]:
df.apply(lambda x: x[0])

A    0.133222
B    0.000000
C    0.811738
D   -0.167453
E    1.242530
F    6.000000
dtype: float64

In [85]:
 s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [86]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [87]:
df = pd.DataFrame(np.random.randn(10, 4))

In [89]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [90]:
right

   key  rval
0  foo     4
1  foo     5

In [91]:
left

   key  lval
0  foo     1
1  foo     2

In [92]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [93]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [94]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [95]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [96]:
index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [97]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [98]:
df

                     A         B
first second
bar   one     0.311178  0.935184
      two     1.343832  0.457127
baz   one     0.062657  1.417083
      two    -0.957578  0.003299
foo   one    -1.269545  0.599105
      two    -0.547873  0.133538
qux   one     0.752954  0.283585
      two     0.882863 -0.231251

In [99]:
df2 = df[:4]

In [100]:
df2

                     A         B
first second
bar   one     0.311178  0.935184
      two     1.343832  0.457127
baz   one     0.062657  1.417083
      two    -0.957578  0.003299

In [101]:
stacked = df2.stack()

In [102]:
stacked

first  second
bar    one     A    0.311178
               B    0.935184
       two     A    1.343832
               B    0.457127
baz    one     A    0.062657
               B    1.417083
       two     A   -0.957578
               B    0.003299
dtype: float64

In [104]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.311178  0.062657
       B  0.935184  1.417083
two    A  1.343832 -0.957578
       B  0.457127  0.003299

In [105]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
  'B' : ['A', 'B', 'C'] * 4,
 'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
 'D' : np.random.randn(12),
 'E' : np.random.randn(12)})

In [106]:
df

        A  B    C         D         E
0     one  A  foo  0.569914 -0.101927
1     one  B  foo -1.678941  1.448052
2     two  C  foo -0.232439  2.891235
3   three  A  bar  1.209825  0.246783
4     one  B  bar  1.126956 -2.352329
5     one  C  bar  1.044423  0.130255
6     two  A  foo -3.040242  0.134729
7   three  B  foo -0.971909  0.581438
8     one  C  foo -1.442347  0.182729
9     one  A  bar -0.188240 -0.387716
10    two  B  bar -1.189482 -1.310513
11  three  C  bar  0.558451  0.824896

In [115]:
pd.pivot_table(df, values='E', index=['C'], columns=['B'])

B           A         B         C
C
bar -0.070467 -1.831421  0.477576
foo  0.016401  1.014745  1.536982

In [126]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [127]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [129]:
ts

2012-01-01 00:00:00    206
2012-01-01 00:00:01    236
2012-01-01 00:00:02     92
2012-01-01 00:00:03    482
2012-01-01 00:00:04    245
2012-01-01 00:00:05    258
2012-01-01 00:00:06     34
2012-01-01 00:00:07    438
2012-01-01 00:00:08    436
2012-01-01 00:00:09    382
2012-01-01 00:00:10      4
2012-01-01 00:00:11    223
2012-01-01 00:00:12    462
2012-01-01 00:00:13    425
2012-01-01 00:00:14    200
2012-01-01 00:00:15    113
2012-01-01 00:00:16     82
2012-01-01 00:00:17    206
2012-01-01 00:00:18     96
2012-01-01 00:00:19    429
2012-01-01 00:00:20    361
2012-01-01 00:00:21      9
2012-01-01 00:00:22    240
2012-01-01 00:00:23    181
2012-01-01 00:00:24     54
2012-01-01 00:00:25    430
2012-01-01 00:00:26    475
2012-01-01 00:00:27    490
2012-01-01 00:00:28    423
2012-01-01 00:00:29    311
                      ...
2012-01-01 00:01:10    305
2012-01-01 00:01:11    307
2012-01-01 00:01:12    439
2012-01-01 00:01:13    130
2012-01-01 00:01:14    357
2012-01-01 00:01:15    434
2012-01-01 00:01:16    446
2012-01-01 00:01:17    215
2012-01-01 00:01:18    432
2012-01-01 00:01:19    192
2012-01-01 00:01:20     41
2012-01-01 00:01:21    104
2012-01-01 00:01:22    338
2012-01-01 00:01:23     64
2012-01-01 00:01:24    405
2012-01-01 00:01:25    197
2012-01-01 00:01:26    456
2012-01-01 00:01:27     40
2012-01-01 00:01:28    434
2012-01-01 00:01:29     28
2012-01-01 00:01:30    319
2012-01-01 00:01:31      9
2012-01-01 00:01:32     22
2012-01-01 00:01:33    312
2012-01-01 00:01:34     34
2012-01-01 00:01:35     61
2012-01-01 00:01:36    103
2012-01-01 00:01:37     97
2012-01-01 00:01:38     34
2012-01-01 00:01:39    100
Freq: S, dtype: int64

In [130]:
ts.resample('1Min').sum()

2012-01-01 00:00:00    16441
2012-01-01 00:01:00     9711
Freq: T, dtype: int64

In [124]:
ts = ts.resample('5Min')

In [131]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [132]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [133]:
ts

2012-03-06    0.752728
2012-03-07    0.338552
2012-03-08    0.831128
2012-03-09   -0.860954
2012-03-10    0.459037
Freq: D, dtype: float64

In [134]:
ts_utc = ts.tz_localize('UTC')

In [135]:
ts_utc

2012-03-06 00:00:00+00:00    0.752728
2012-03-07 00:00:00+00:00    0.338552
2012-03-08 00:00:00+00:00    0.831128
2012-03-09 00:00:00+00:00   -0.860954
2012-03-10 00:00:00+00:00    0.459037
Freq: D, dtype: float64

In [136]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.752728
2012-03-06 19:00:00-05:00    0.338552
2012-03-07 19:00:00-05:00    0.831128
2012-03-08 19:00:00-05:00   -0.860954
2012-03-09 19:00:00-05:00    0.459037
Freq: D, dtype: float64

In [137]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [138]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [140]:
ts

2012-01-31   -0.165536
2012-02-29   -0.771387
2012-03-31   -0.287900
2012-04-30    1.655406
2012-05-31    0.823078
Freq: M, dtype: float64

In [142]:
ps = ts.to_period()

In [144]:
ps.to_timestamp()

2012-01-01   -0.165536
2012-02-01   -0.771387
2012-03-01   -0.287900
2012-04-01    1.655406
2012-05-01    0.823078
Freq: MS, dtype: float64

In [145]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [146]:
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='int64', freq='Q-NOV')

In [147]:
 ts = pd.Series(np.random.randn(len(prng)), prng)

In [161]:
prng.asfreq('M','e').asfreq('H','s') + 9

PeriodIndex(['1990-02-01 09:00', '1990-05-01 09:00', '1990-08-01 09:00',
             '1990-11-01 09:00', '1991-02-01 09:00', '1991-05-01 09:00',
             '1991-08-01 09:00', '1991-11-01 09:00', '1992-02-01 09:00',
             '1992-05-01 09:00', '1992-08-01 09:00', '1992-11-01 09:00',
             '1993-02-01 09:00', '1993-05-01 09:00', '1993-08-01 09:00',
             '1993-11-01 09:00', '1994-02-01 09:00', '1994-05-01 09:00',
             '1994-08-01 09:00', '1994-11-01 09:00', '1995-02-01 09:00',
             '1995-05-01 09:00', '1995-08-01 09:00', '1995-11-01 09:00',
             '1996-02-01 09:00', '1996-05-01 09:00', '1996-08-01 09:00',
             '1996-11-01 09:00', '1997-02-01 09:00', '1997-05-01 09:00',
             '1997-08-01 09:00', '1997-11-01 09:00', '1998-02-01 09:00',
             '1998-05-01 09:00', '1998-08-01 09:00', '1998-11-01 09:00',
             '1999-02-01 09:00', '1999-05-01 09:00', '1999-08-01 09:00',
             '1999-11-01 09:00', '2000-02-01 09:00', '2000-05-01 09:00',
             '2000-08-01 09:00', '2000-11-01 09:00'],
            dtype='int64', freq='H')

In [162]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [163]:
df["grade"] = df["raw_grade"].astype("category")

In [164]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [165]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [167]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [168]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad